In [5]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.1-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.1-cp310-cp310-win_amd64.whl (11.6 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import pandas as pd

1.    צרו DataFrame של תלמידות עם העמודות: שם, כיתה, וממוצע ציונים.

2.    הוסיפו ל-DataFrame תלמידה חדשה.

3.   הציגו רק את שמות התלמידות מה-DataFrame.
4.   בחרו והדפיסו את כל התלמידות שבכיתה 'יא'.

5.  מצאו והדפיסו את התלמידה עם הממוצע הגבוה ביותר.

In [14]:
data = {'name': ['תמר', 'לאה', 'רות'],
        'class': ['ג', 'ה', 'ח'],
        'avg marks': [97, 90, 95]}

In [15]:
sample = pd.DataFrame(data)

In [16]:
sample

  name class  avg marks
0  תמר     ג         97
1  לאה     ה         90
2  רות     ח         95

In [56]:
sample.loc[len(sample.index)] = [ "אלשיבע", "ח", 98]

In [57]:
sample['name']

0       תמר
1       לאה
2       רות
3    אלשיבע
4    אלשיבע
Name: name, dtype: object

In [58]:
sample[sample['class'] == "ח"]

     name class  avg marks
2     רות     ח         95
3  אלשיבע     ח         98
4  אלשיבע     ח         98

In [59]:
sample['avg marks'].max()

98

תרגיל






טעינת נתונים

טענו את הנתונים מהקובץ cities.csv ל-DataFrame ב-pandas.
שלב 2: ניקוי נתונים

בדקו אם יש עמודות עם ערכים חסרים ומלאו אותם באפס או בערך הממוצע של העמודה, בהתאם להקשר.
הסירו שורות כפולות, אם ישנן.
שלב 3: ניתוח וחישובים

חשבו את הממוצע של אוכלוסייה לפי מדינה.
מצאו את העיר עם האוכלוסייה הגדולה ביותר והקטנה ביותר.
שלב 4: שינויים והוספות

הוסיפו עמודה חדשה שתכיל את היחס בין אוכלוסייה לשטח העיר (אוכלוסייה לקמ"ר).
שנו את שם עמודת האוכלוסייה ל-"Population".
שלב 5: סינון ומיון

סננו את הנתונים כך שישארו רק ערים מתוך מדינה אחת לבחירתכם.
מיינו את הנתונים לפי האוכלוסייה בסדר יורד.
שלב 6: יצוא נתונים

יצאו את ה-DataFrame לקובץ CSV חדש שיכיל את הנתונים לאחר הסינון והמיון

In [60]:
df = pd.read_csv('cities.csv')

In [61]:
df

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

In [66]:
df.isnull().sum().sum()

0

In [67]:
df.isnull().sum()

LatD        0
 "LatM"     0
 "LatS"     0
 "NS"       0
 "LonD"     0
 "LonM"     0
 "LonS"     0
 "EW"       0
 "City"     0
 "State"    0
dtype: int64

In [71]:
df['LatD'] = df.LatD.fillna(0)

In [78]:
df['LatD'].mean()

38.8203125

In [81]:
df['LatD'].mean()

38.8203125

In [83]:
df['LatD'].max()

50

In [84]:
df['LatD'].min()

26

In [106]:
df.rename(columns={'"LatM"': 'Population'}, inplace=True)

In [105]:
df.rename(columns={'"LonD"': 'LonD'}, inplace=True)

In [102]:
df

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

In [108]:
df.insert(3, "Relation", Population/LatM)

NameError: name 'Population' is not defined